{
	"name": "Aidan Richardson",
	"title": "Computer Science Student",
	"description": "<p>Hi, I'm Aidan, an enthusiastic computer scientist with strong interests in <b>data science</b>, <b>web development</b>, and <b>cyber security</b>. I'm currently in the final year of my <b>BEng in Computer Science</b> at the <b>University of York</b>. At university I have developed an appreciation for using data to solve real-world problems and hope to apply this in the workplace.</p><p>I thrive in the <b>fast-moving</b> world of technology, where I'm constantly learning new topics and skills. I <b>learn quickly</b> and have <b>strong problem-solving skills</b> which I apply through both academic work and personal projects. I’ve recently started sharing my projects on <b>GitHub</b>, hoping they can inspire and assist others.</p><p>I have experience working in <b>IT support</b> which has strengthened my <b>communication</b>, <b>teamwork</b>, and <b>leadership</b> skills, as well as my ability to <b>explain complex concepts clearly and effectively</b>.</p><p>After completing my degree I aspire to apply my skills on projects that make a meaningful impact and help others.</p>",
	"image": "profilepic.jpg",
	"projects": [
		{
			"title": "WhatsPlaying",
			"link": "https://github.com/AidanRichardson/whatsplaying",
			"tools": [
				{"name":"Docker", "icon":"docker.svg"},
				{"name":"TypeScript", "icon":"typescript.svg"},
				{"name":"Svelte", "icon":"svelte.svg"}

			],
			"image": [
				"whatsplaying1.png",
				"whatsplaying2.png",
				"whatsplaying3.gif"
			],
			"description": "WhatsPlaying is lightweight docker app that lets users display what's currently playing on their spotify account on any device with a web browser. It's perfect for showing music on smart displays and other devices on the local network. I built this app mainly so my smart TV could display the music playing when I have friends over. This is my first svelte app and I have learnt a lot. It is also the first app I have released that will require user's to set up themselves. This has taught me a lot about making a guide and keeping the app simple/user friendly. I look forward to using these skills on future projects and will occasionally update this app with new features."
		}
	],
	"work": [
		{
			"image": ["itsupport.avif"],
			"title": "1st Line IT Support Technician",
			"company":"Network Computing LTD",
			"description": "As a 1st Line at Network I worked in a small team to provide IT support to over 1500 end users and machines. I had to learn quickly and be adaptable as I was on the phones helping clients within my first month on the job. I spoke to a large range of clients from junior staff to chief executives, testing my communication skills. I learnt to demystify complex systems to make them easy for users to understand. Early on, I understood the importance of utilising the skills of my team members, allowing me to get the job done more effectively as well as developing my skills to make my work better in the future. By working at a smaller company it has allowed me to mature quickly by experiencing some challenging situations and learning from them. It allowed me to see the ins and outs of a company as well as understanding my role in a team."
		}
	],
	"education": [
		{
			"image": ["uoy.jpeg"],
			"title": "University of York",
			"description": " I am currently studying Computer Science at the University of York. In my time at York I have been taught a wide range of computer science concepts, with my favourite being data science and cryptography. I have averaged 73% (1st Class) throughout my degree and I continue to aim for a first in my final year. In my time at university I have improved my leadership, time management and communication skills, through societies and group projects. I have explored new hobbies such as climbing and badminton which I use to stay fit in my spare time."
		}
	],
	"languages": {
		"title": "Languages",
		"list_items": [
			{ "name": "Python", "icon": "python.svg" },
			{ "name": "Java", "icon": "java.svg" },
			{ "name": "JavaScript", "icon": "javascript.svg" },
			{ "name": "TypeScript", "icon": "typescript.svg" },
			{ "name": "HTML", "icon": "html.svg" },
			{ "name": "CSS", "icon": "css.svg" },
			{ "name": "SQL", "icon": "sql.svg" },
			{ "name": "YAML", "icon": "yaml.svg" }
		]
	},
	"skills": {
		"title": "skills",
		"list_items": [
			{ "name": "Leadership", "icon": "leadership.png" },
			{ "name": "Communication", "icon": "communication.jpg" },
			{ "name": "IT Skills", "icon": "itskills.jpg" },
			{ "name": "Project Management", "icon": "projectman.webp" },
			{ "name": "Time Management", "icon": "timeman.avif" },
			{ "name": "Problem Solving", "icon": "psolving.jpg" },
			{ "name": "Linux", "icon": "linux.svg" },
			{ "name": "Docker", "icon": "docker.svg" },
			{ "name": "Anaconda", "icon": "anaconda.svg" },
			{ "name": "Jupyter Notebooks", "icon": "jupyter.svg" },
			{ "name": "Pandas", "icon": "pandas.svg" },
			{ "name": "SciKitLearn", "icon": "scikitlearn.svg" },
			{ "name": "MatPlotLib", "icon": "matplotlib.svg" },
			{ "name": "SQLite", "icon": "sqlite.svg" },
			{ "name": "PyTorch", "icon": "pytorch.svg" },
			{ "name": "React", "icon": "react.svg" },
			{ "name": "Svelte", "icon": "svelte.svg" }
		]
	},
	"links":[{
		"link": "https://github.com/aidanrichardson",
		"icon":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYiBwe7URF5iyjMW20qp4IvMNvys8-tGb_-A&s",
		"title":"GitHub"
	},{
		"link":"https://www.linkedin.com/in/aidan-richardson-964888250/",
		"icon":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/LinkedIn_icon.svg/1024px-LinkedIn_icon.svg.png",
		"title":"LinkedIn"
	}]
}
