{
	"name": "Aidan Richardson",
	"title": "Computer Science Student",
	"description": "<p>Hi, I'm Aidan, an enthusiastic computer scientist with strong interests in <b>data science</b>, <b>web development</b>, and <b>cyber security</b>. I'm currently in the final year of my <b>BEng in Computer Science</b> at the <b>University of York</b>. At university I have developed an appreciation for using data to solve real-world problems and hope to apply this in the workplace.</p><p>I thrive in the <b>fast-moving</b> world of technology, where I'm constantly learning new topics and skills. I <b>learn quickly</b> and have <b>strong problem-solving skills</b> which I apply through both academic work and personal projects. I’ve recently started sharing my projects on <b>GitHub</b>, hoping they can inspire and assist others.</p><p>I have experience working in <b>IT support</b> which has strengthened my <b>communication</b>, <b>teamwork</b>, and <b>leadership</b> skills, as well as my ability to <b>explain complex concepts clearly and effectively</b>.</p><p>After completing my degree I aspire to apply my skills on projects that make a meaningful impact and help others.</p>",
	"image": "profilepic.jpg",
	"projects": [
		{
			"title": "What's Playing?",
			"link": "https://github.com/AidanRichardson/whatsplaying",
			"tools": [
				{"name":"Docker", "icon":"docker.svg"},
				{"name":"TypeScript", "icon":"typescript.svg"},
				{"name":"Svelte", "icon":"svelte.svg"}

			],
			"image": [
				"whatsplaying2.png",
				"whatsplaying1.png",
				"whatsplaying3.gif"
			],
			"description": "Basic docker app so a user can host thier spotify playing in a web app that can then be displayed on other devices Basic docker app so a user can host thier spotify playing in a web app that can then be displayed on other devices Basic docker app so a user can host thier spotify playing in a web app that can then be displayed on other devices Basic docker app so a user can host thier spotify playing in a web app that can then be displayed on other devices"
		}
	],
	"languages": {
		"title": "Languages",
		"items": [
			{ "name": "Python", "icon": "python.svg" },
			{ "name": "Java", "icon": "java.svg" },
			{ "name": "JavaScript", "icon": "javascript.svg" },
			{ "name": "TypeScript", "icon": "typescript.svg" }
		]
	},
	"skills": {
		"title": "skills",
		"items": [
			{ "name": "Python", "icon": "python.svg" },
			{ "name": "JavaScript", "icon": "javascript.svg" },
			{ "name": "TypeScript", "icon": "typescript.svg" }
		]
	},
	"links":[{
		"link": "https://github.com/aidanrichardson",
		"icon":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYiBwe7URF5iyjMW20qp4IvMNvys8-tGb_-A&s",
		"title":"GitHub"
	},{
		"link":"https://www.linkedin.com/in/aidan-richardson-964888250/",
		"icon":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/LinkedIn_icon.svg/1024px-LinkedIn_icon.svg.png",
		"title":"LinkedIn"
	}]
}
